# Pandas Basic Assignment

Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
#Answer

import pandas as pd
data = [4,8,15,16,23,42]
my_series = pd.Series(data)
print(my_series)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [2]:
my_var = [2,4,6,8,10,12,14,16,18,20]
my_series = pd.Series(my_var)
print(my_series)

0     2
1     4
2     6
3     8
4    10
5    12
6    14
7    16
8    18
9    20
dtype: int64

Q3. Create a Pandas DataFrame that contains the following data:    Then, print the DataFrame.

In [3]:
#Answer
data = {"Name": ["Alice", "Bob", "Claire"],
       "Age": [25,30,27],
       "Gender" : ["Female", "Male", "Female"] }
df = pd.DataFrame(data)
print(df)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In [4]:
#Answer

#DataFrame -

# DataFrame is a 2-dimensional labeled data structure with columns of potentially different types. we can think of it like a
# spreadsheet or SQL table, or a dict of Series objects. It is generally the most commonly used pandas object.

#Series -

# A pandas Series is a one-dimensional array. It holds any data type supported in Python and uses labels to locate each 
# data value for retrieval.
# These labels form the index, and they can be strings or integers. A Series is the main data structure in the pandas framework
# for storing one-dimensional data.

#Data Frame Example -

data = {"Name": ["Alice", "Bob", "Claire"],
       "Age": [25,30,27],
       "Gender" : ["Female", "Male", "Female"] }
df = pd.DataFrame(data)
print(df)
type(df)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

pandas.core.frame.DataFrame

In [5]:
#Series Example
# Series
a = [1, 7, 2]
s = pd.Series(a)
print(s)
type(s)

0    1
1    7
2    2
dtype: int64

pandas.core.series.Series

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

In [6]:
#Answer -
#Pandas provides a wide range of function to manipulate data in a Dataframe. some common functions and their use cases are:
#1. pd.read_csv , pd.read_excel   #this helps in reading the file or we can say opening the file in the notebook
#2. df.head() , df.tail()         #this function allows us to view the firstor last n rows of the DataFrame
#3. df.columns                    #this function shows all the columns of the dataframe
#4. df.describe()                 #this provides the statistics of numerical columns in the dataframe 
#5. df.info()            #this function gives information about dataframe including data types, non-null values and memory used
#6. df.sort_values()     #this sorts the dataframe by one or more columns, either in ascending or descending order
#7. df.groupby()         #used to group data based on one or more columns, and perform aggregate operations on those group
#8. df.fillna()          #used to replace missing values(NaN) with a specified value or methord


#And many more

In [7]:
# SOME OF THE EXAMPLES ARE------
df = pd.read_csv("titanic.csv")
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [8]:
df.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True

In [9]:
df.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [10]:
df.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

In [11]:
#Answer

# Among Series, DataFrame and Panel, Series and DataFrame are mutable while Panel is ummutable.

# Series : It is mutable in nature as we change modify the data cotents after creation of series.
# DataFrame : It is also mutable that means we can change or alter data after the creation of dataframe
# Panel : Panel is ummutable, so we cannot change anything after we creat it

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [12]:
#Answer

name = pd.Series(["Honey", "Bunny", "Sunny"])
age = pd.Series([22,32,42])                                #Creating multiple series
job = pd.Series(["Data Scientist", "Driver", "Cook"])

df = pd.DataFrame({"Name" : name,
                  "Age" : age,        #Putting the values into the DataFrame
                  "Job" : job})
print(df)        #Printing the values

    Name  Age             Job
0  Honey   22  Data Scientist
1  Bunny   32          Driver
2  Sunny   42            Cook